#include "delay.h"

#define USE_SYSTICK_DELAY 1	 //1?a那1車?systick2迆谷迆?車那㊣㏒?0?a??赤“?車那㊣

/*豕?1?那1車?systick℅¯?a?車那㊣㏒?辰??“辰a?豕3?那??‘systick㏒??∩?豕米¯車?o‘那ydelay_init(u8 pclk2)*/

#if USE_SYSTICK_DELAY
static __IO uint32_t TimingDelay;

extern u32 SystemCoreClock;
/********************************************************************************************************
**o‘那yD??⊿ ㏒odelay_init()                 
**1|?邦?豕那? ㏒osystick?車那㊣o‘那y3?那??‘
**那?豕?2?那y ㏒o?T
**那?3?2?那y ㏒o?T
********************************************************************************************************/
void delay_init()
{
    if (SysTick_Config(SystemCoreClock / 1000))
    { 
        /* Capture error */ 
        while (1);
    }
    /* Configure the SysTick handler priority */
    NVIC_SetPriority(SysTick_IRQn, 0x0);//SysTick?D??車??豕??谷豕??
}

/********************************************************************************************************
**o‘那yD??⊿ ㏒oTimingDelay_Decrement(void)               
**1|?邦?豕那? ㏒o辰?1ms米??迄?豕米Y??
**那?豕?2?那y ㏒opclk2㏒?角y豕??米赤3那㊣?車?a8MHz㏒?2?那y車|∩?豕?8
**那?3?2?那y ㏒o?T
********************************************************************************************************/
void TimingDelay_Decrement(void)
{
    if (TimingDelay != 0x00)
    { 
        TimingDelay--;
    }
}

/********************************************************************************************************
**o‘那yD??⊿ ㏒oSysTick_Handler(void)                    
**1|?邦?豕那? ㏒o??豕????D??o‘那yo車㏒?Systick??DD米Y??
**那?豕?2?那y ㏒o?T
**那?3?2?那y ㏒o?T
********************************************************************************************************/
void SysTick_Handler(void)
{
    TimingDelay_Decrement();
}

/********************************************************************************************************
**o‘那yD??⊿ ㏒odelay_ms(__IO uint32_t nTime)                     
**1|?邦?豕那? ㏒o3足D辰車|車?米¯車??車那㊣㏒?那1車?systick
**那?豕?2?那y ㏒onTime㏒o?車那㊣
**那?3?2?那y ㏒o?T
********************************************************************************************************/
void delay_ms(__IO uint32_t nTime)
{ 
    TimingDelay = nTime;
    
    while(TimingDelay != 0);
}
#else

/********************************************************************************************************
**o‘那yD??⊿ ㏒odelay_us(__IO uint32_t nTime)                 
**1|?邦?豕那? ㏒o3足D辰車|車?米¯車??車那㊣
**那?豕?2?那y ㏒onTime㏒o?車那㊣
**那?3?2?那y ㏒o?T
********************************************************************************************************/
void delay_us(__IO uint32_t nTime)
{		
    u16 i=0;   
    while(nTime--)   
    {   
        i=10;  //℅??o?“辰?      
        while(i--);       
    }					 
}
/********************************************************************************************************
**o‘那yD??⊿ ㏒odelay_ms(__IO uint32_t nTime)                     
**1|?邦?豕那? ㏒o3足D辰車|車?米¯車??車那㊣
**那?豕?2?那y ㏒onTime㏒o?車那㊣
**那?3?2?那y ㏒o?T
********************************************************************************************************/
void delay_ms(__IO uint32_t nTime)
{	 		  	  
    u16 i=0;   
    while(nTime--)   
    {      
        i=750;  //℅??o?“辰?    
        while(i--);        
    }	  	    
} 
#endif

